package nowCoder;

/**
 * @Author Lyz
 * @Date: 2022/4/27 20:10
 * @Version 1.0
 * <p>
 * JZ15 二进制中1的个数
 * 描述
 * 输入一个整数 n ，输出该数32位二进制表示中1的个数。其中负数用补码表示。
 * <p>
 * 数据范围：- 2^{31} <= n <= 2^{31}-1−2
 * 31
 * <=n<=2
 * 31
 * −1
 * 即范围为:-2147483648<= n <= 2147483647−2147483648<=n<=2147483647
 * <p>
 * 示例1
 * 输入：10
 * 返回值：2
 * 说明：
 * 十进制中10的32位二进制表示为0000 0000 0000 0000 0000 0000 0000 1010，其中有两个1。
 * 示例2
 * 输入：-1
 * 返回值：32
 * 说明：
 * 负数使用补码表示 ，-1的32位二进制表示为1111 1111 1111 1111 1111 1111 1111 1111，其中32个1
 */
public class T15 {
    public static int NumberOf1(int n) {
        int res = 0;
        // 遍历32位
        for (int i = 0; i < 32; i++) {
            // 按位比较
            if ((n & (1 << i)) != 0) {
                res++;
            }
        }
        return res;
    }

    public static void main(String[] args) {
        int n = 10;
        System.out.println(NumberOf1(n));
    }
}
